#print("반가워요 파이썬~~~^^")

#(전체적인 주석처리 드래그 후 단축키 ctrl+/)
#줄주석은 그 중만 적용됩니다.
# print("반가워용~~ 파이썬 ^^")#줄주석은 이렇게 그행의 설명을 적습니다.
# pr#주석은 이렇게 #이후로 모두 적용됩니다. 단, 그줄만int("hello")

'''
print("python #문자열안에 들어가는 #은 주석의 용도로 사용 못합니다.첫날 입니다")
print("python을 시작해볼까요")
print("hello")
'''
# print()
# print("python 첫날 입니다")
# print("python을 시작해볼까요")
# print()
"""
블럭주석은 이렇게 연속적인 코드(주문서)를 예외적용 시킬때 사용한다.
홀따옴표나 쌍따옴표 모두 3개씩 찍으면되고 같은 따옴표로 열고 닫기만
잘해주면됩니다.
"""

# print()
# print("hello")
# print("python 첫날 입니다")
# print("python을 시작해볼까요")
'''
print("쌍따움표 안의 내용출력");print("이어 쓰기 실행")
print("이어쓰기;");print();print(";(쎄미콜론이라고 읽는다)")

# 한줄에 두 오더가 있을 경우 ;로 인식해주기
# 간단표현되고 연계성이 있을 경우 같이 써도 됨. (가급적 한줄에 한오더)
# 한 줄 끝에 원엔(\n)이 생략
'''

"""
# print(""영희야 안녕"")- error, 2가지 방법
print(" \"영희야 안녕\" ")
print(' "영희야 안녕"')
"""
# print("hello python")
# print("hello \npython")
# print("재밌는");print("python")

'''
print("holle"
    "python"   #()안 문장들은 씌기 없이 출력됨.
    "start")
print("holle\n"
"python\n"
"start")
'''

# 열 확보된 상태에서 ctrl + Alt + 방향키로 여러개의 열선택 후 동일한 코드 입력가능
# 선택범위 취소는 esc
"""
# print("저의 이름은 홍길동입니다.")
# print("저의 이름은 20살입니다.")
# print("주소는 산골자기 입니다.")

# print("저의 이름은 홍길동입니다.\n"
#     "저의 이름은 20살입니다.\n"
#     "주소는 산골자기 입니다.")
"""

print("123456781234567812345678123456781234567812345678")
print("대한민국\t만세\t대한독립\t만만세")
